메타버스/CM_009/Main.yml
config:
  target: "https://komscoverse.kro.kr"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 3
      arrivalRate: 100
      rampTo: 100
      name: Test
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
  - flow:
    - post:
        url: "/app/auth/usersignin"
        capture:
          - json: "$"
            as: response
    - log: "Give me response {{response}}"
    - post:
        url: "/app/main/vr-connect"
        headers:
          sessionToken: "{{response._sessionToken}}"
        json:
            code: "57"
            name: "Test"
            id: "1234"
        capture:
          - json: "$"
            as: responseWorld
    - log: "Give me response {{responseWorld}}"